fobe-projects/micropython/ports/esp32/boards/FOBE_QUILL_ESP32S3_MESH/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "FoBE Quill ESP32S3 Mesh"
#define MICROPY_HW_MCU_NAME                 "ESP32-S3"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "Quill-ESP32S3"

#define MICROPY_HW_I2C0_SDA                 (35)
#define MICROPY_HW_I2C0_SCL                 (36)

#define MICROPY_HW_SPI1_MOSI                (33)
#define MICROPY_HW_SPI1_MISO                (34)
#define MICROPY_HW_SPI1_SCK                 (47)
